IDEA Open Model
WeldType Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Represents the code of the position
 Namespace: IdeaRS.OpenModel.Parameters
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum WeldType
Public Enumeration WeldType
Members
Member name | Value | Description
None | 0 |  No weld
LeftFillet | 1 |  Fillet weld is on the left side
RightFillet | 2 |  Fillet weld on the right side
DoubleFillet | 3 |  Fillet weld on both sides (double fillet)
Bevel | 4 |  Bevel weld
See Also
Reference
IdeaRS.OpenModel.Parameters Namespace